# RemovePartCustomData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..RemovePartCustomData Method
FabricationPart Class See Also
---
Remove custom data from the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool RemovePartCustomData(
	int customId
)
```

Visual Basic
---
```text
Public Function RemovePartCustomData ( _
	customId As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool RemovePartCustomData(
	int customId
)
```

# ### Parameters
customId
    Type: System..::..Int32 The identifier of the custom data field to remove.
# ### Return Value
Returns true if the type was found and removed. The type will not be removed if it is not an optional type.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The custom data does not exist on the part. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace